

#ifndef _DSP_LOG4J_H_
#define _DSP_LOG4J_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */

#include "log4j_client.h"
#include "sal_type.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */

#define SAL_loginfo log4j_dsp_info
#define SAL_logwarn log4j_dsp_warn
#define SAL_logerror log4j_dsp_error


typedef enum
{
    LOG4J_LOG_LV_DEFAULT = -1,       /* 默认值 */
    LOG4J_LOG_LV_ERR = 0,            /* 错误打印 */
    LOG4J_LOG_LV_WARN,               /* 警告打印 */
    LOG4J_LOG_LV_INFO,               /* 通告打印 */
    LOG4J_LOG_LV_DBG,                /* 调试打印 */
    LOG4J_LOG_LV_MAX
}Log4j_LogRecordLevel;

/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */

/*******************************************************************************
* 函数名  : Log4j_init
* 描  述  : 
* 输  入  : 无
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 Log4j_init(VOID);

/*******************************************************************************
* 函数名  : Log4j_recordLevel
* 描  述  : 
* 输  入  : - level:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 Log4j_recordLevel(UINT32 level);

/*******************************************************************************
* 函数名  : Log4j_setRecordLevel
* 描  述  : 
* 输  入  : - level:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 Log4j_setRecordLevel(UINT32 level);

/*******************************************************************************
* 函数名  : Log4j_updateSyncStatus
* 描  述  : 
* 输  入  : - status:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 Log4j_updateSyncStatus(UINT32 status);

/*******************************************************************************
* 函数名  : Log4j_helpInfo
* 描  述  : 
* 输  入  : 无
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
void Log4j_helpInfo(VOID);

/*******************************************************************************
* 函数名  : Log4j_procProcess
* 描  述  : 
* 输  入  : - FunctionStr:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
void Log4j_procProcess(INT8 * FunctionStr);

#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif

