/*******************************************************************************
 * sal_mutex.h
 *
 * HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
 *
 * Author : heshengyuan <heshengyuan@hikvision.com> liuyun10 <liuyun10@hikvision.com>
 * Version: V1.0.0  2018年11月21日 Create
 *
 * Description : 软件抽象层模块对外提供的互斥锁接口，使用流程如下:
           ==========================
                   |                            
           SAL_mutexCreate
                   |
           SAL_mutexLock/SAL_mutexUnlock/SAL_mutexWait/SAL_mutexSignal
                   |
           SAL_mutexDelete
           ===========================
           
           注意:
                SAL_MUTEX_NORMAL 为常见的互斥锁，同一线程不能加锁多次
                SAL_MUTEX_RECURSIVE 为支持嵌套锁的互斥锁，同一线程可以循环加锁多次，小心使用，避免死锁
 * Modification: 
 *******************************************************************************/
#ifndef _SAL_MUTEX_H_
#define _SAL_MUTEX_H_

#ifdef __cplusplus
extern "C" {
#endif

/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */

/*定义互斥锁的类型*/
typedef enum
{
    SAL_MUTEX_NORMAL = 0,      /*普通锁,不支持递归*/
    SAL_MUTEX_RECURSIVE        /*递归锁,支持递归加锁,即同一线程可以对锁加锁多次*/
}SAL_MutexType;


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */

/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */
/*******************************************************************************
* 函数名  : SAL_mutexCreate
* 描  述  : 该函数负责创建一个互斥锁
* 输  入  : - type   : 互斥锁类型,参见 SAL_MutexType定义
*         : - phMutex: 互斥锁句柄指针,当创建成功时输出互斥锁句柄
* 输  出  : 无
* 返回值  : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
INT32 SAL_mutexCreate(UINT32 type, Handle *phMutex);

/*******************************************************************************
* 函数名  : SAL_mutexLock
* 描  述  : 互斥锁加锁
* 输  入  : - hMutex: 互斥锁句柄,
* 输  出  : 无
* 返回值  : HIK_SOK:   成功
*           HIK_FAIL: 失败
*******************************************************************************/
INT32 SAL_mutexLock(Handle hMutex);

/*******************************************************************************
* 函数名  : SAL_mutexUnlock
* 描  述  : 互斥锁解锁
*           该接口不能在内核态中断上下文调用
* 输  入  : - hMutex: 互斥锁句柄,
* 输  出  : 无
* 返回值  : HIK_SOK:   成功
*           HIK_FAIL: 失败
*******************************************************************************/
INT32 SAL_mutexUnlock(Handle hMutex);

/*******************************************************************************
* 函数名  : SAL_mutexTimeOutWait
* 描  述  : 等待信号解锁和等待超时，需要处理返回值
* 输  入  : - hMutex     : 互斥锁句柄
*         : - msecTimeOut: 毫秒的超时时间
* 输  出  : 无
* 返回值  : SAL_ETIMEOUT : 超时返回
*           SAL_SOK      : 接收到信号正常返回
*           SAL_FAIL     : 异常返回
*******************************************************************************/
INT32 SAL_mutexTimeOutWait(Handle hMutex, INT32 msecTimeOut);

/*******************************************************************************
* 函数名  : SAL_mutexWait
* 描  述  : 阻塞等待接收信号才能退出，外部需要管理好SAL_mutexLock/SAL_mutexUnlock的使用
* 输  入  : - hMutex: 互斥锁句柄
* 输  出  : 无
* 返回值  : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
INT32 SAL_mutexWait(Handle hMutex);

/*******************************************************************************
* 函数名  : SAL_mutexSignal
* 描  述  : 给 SAL_mutexWait 发送退出信号
* 输  入  : - hMutex: 互斥锁句柄
* 输  出  : 无
* 返回值  : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
INT32 SAL_mutexSignal(Handle hMutex);

/*******************************************************************************
* 函数名  : SAL_mutexDelete
* 描  述  : 该函数负责销毁一个互斥锁
*           该接口不能在内核态中断上下文调用
* 输  入  : - hMutex: 互斥锁句柄
* 输  出  : 无。
* 返回值  : HIK_SOK:   成功
*           HIK_FAIL: 失败
*******************************************************************************/
INT32 SAL_mutexDelete(Handle hMutex);

/*******************************************************************************
* 函数名  : SAL_mutexBroadcast
* 描  述  : 给所有 SAL_mutexWait 发送退出信号
* 输  入  : - hMutex: 互斥锁句柄
* 输  出  : 无
* 返回值  : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
INT32 SAL_mutexBroadcast(Handle hMutex);

#ifdef __cplusplus
}
#endif

#endif

