 #ifndef _SAL_MAP_H_
#define _SAL_MAP_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */


#ifdef __cplusplus
extern "C"{
#endif /* __cplusplus */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */
typedef enum
{
    SAL_SHM_ROLE_CLIENT = 0x01,
    SAL_SHM_ROLE_SERVER = 0x02,
} SAL_SHM_ROLE;


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */

/*******************************************************************************
* 函数名  : SAL_mmapFileInit
* 描  述  : 封装通过文件方式做共享内存映射的通用函数
* 输  入  : - pFileName: 文件路径, 该文件直接属于内存空间上，通讯效率和同步会快
*         : - role     : 服务端还是客户端，区别只是初始化时是否清空文件内容，其他
                         无差别
*         : - size     : 映射大小，也是共享内存的大小
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
void *SAL_mmapFileInit(const INT8 *pFileName, UINT32 role, UINT32 size);


/*******************************************************************************
* 函数名  : SAL_mmapFileDeinit
* 描  述  : 是否文件映射共享内存
* 输  入  : - pVaddr: 释放地址，需要使用虚拟地址
*         : - size  : 内存长度
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 SAL_mmapFileDeinit(void *pVaddr, UINT32 size);


#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif
