/*******************************************************************************
 * sal_socket.h
 *
 * HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
 *
 * Author : hsy <heshengyuan@hikvision.com>
 * Version: V1.0.0  2020年9月27日 Create
 *
 * Description : 
 * Modification: 
 *******************************************************************************/
#ifndef _SAL_SOCKET_H_
#define _SAL_SOCKET_H_


/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */


#ifdef __cplusplus
extern "C"{
#endif /* __cplusplus */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */

typedef void(*SAL_socketOpsRecv)(Handle hSocket, INT32 recvStatus, const void* data, INT32 dataLen, const void* url);

/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */
/*******************************************************************************
* 函数名  : SAL_socketClose
* 描  述  : 消耗套接字
* 输  入  : - socketFd:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
int SAL_socketClose(INT32 socketFd);

/*******************************************************************************
* 函数名  : SAL_socketOpen
* 描  述  : 通过指定的 URL 字符串地址，建立SOCKET通讯
* 输  入  : - socketFd:
*         : - url     : 该字符串可以是路径或者网络地址
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
int SAL_socketOpen(INT32 *pSocketFd, const char *pUrl);

/*******************************************************************************
* 函数名  : SAL_socketSend
* 描  述  : 主动发送消息
* 输  入  : - hSocket: 套接字句柄
*         : - data   : 数据内容
*         : - dataLen: 长度
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 SAL_socketSend(INT32 socketFd, const char *pUrl, const void *pData, INT32 dataLen);

/*******************************************************************************
* 函数名  : SAL_socketRecv
* 描  述  : 接受数据 URL 已经隐藏在套接字句柄内了
* 输  入  : - hSocket: 套接字句柄
*         : - pData  :
*         : - dataLen:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 SAL_socketRecv(INT32 socketFd, void *pData, INT32 *pDataLen, char *pRemoteUrl);


#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif

