/*******************************************************************************
* _SAL_MEMLIST_H_
* Description: 链表内存管理接口。
*******************************************************************************/
#include <sal.h>
#include <sal_linkedList.h>

#ifndef _SAL_MEMLIST_H_
#define _SAL_MEMLIST_H_

/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */
#define LIST_CONT_LEN   32   /* 申请的内存块名称长度 */   

typedef enum
{
    CHECK_PATTERN_ORDER   = 0,
    CHECK_PATTERN_SIZE    = 1,
    CHECK_PATTERN_MODULE  = 2,
    CHECK_PATTERN_MAX,                /* 预留 */
}CHECK_PATTERN;

/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */
/* 链表头 */
typedef struct SAL_ListMHead
{
    char modelName[LIST_CONT_LEN]; /* 申请的内存块名称 */

    SAL_MemBlockObject salListHead;         /* 内存块头信息结构体 */
    SAL_MemBlockObject salListEnd;          /* 内存块尾信息结构体 */
  
    List_head salList;
}TSAL_ListMemHead;

/* ========================================================================== */
/*                          函数定义区                                        */
/* ========================================================================== */

/*******************************************************************************
* 函数名  : SAL_memListCheck
* 描  述  : 链表遍历接口
* 输  入  : - void:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
void SAL_memListCheck(INT32 checkPattern);

/*******************************************************************************
* 函数名  : SAL_memListAdd
* 描  述  : 链表增加节点
* 输  入  : - pBufHead: 
*           - pBufEnd: 
*           - size：
* 输  出  : 无。
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 SAL_memListAdd(SAL_MemBlockObject *pBufHead, SAL_MemBlockObject *pBufEnd,  UINT32 size, const char *modId);

/*******************************************************************************
* 函数名  : SAL_memListDel
* 描  述  : 删除节点
* 输  入  : - pBufHead: 
* 输  出  : 无。
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 SAL_memListDel(SAL_MemBlockObject *pBufHead);

 /*******************************************************************************
 * 函数名  : SAL_memList
 * 描  述  : 获取内存管理链表
 * 输  入  : - VOID:
 * 输  出  : 无
 * 返回值  : SAL_SOK  : 成功
 *           SAL_FAIL : 失败
 *******************************************************************************/
 List_head *SAL_memList(VOID);

 /*******************************************************************************
 * 函数名  : SAL_memSetListHead
 * 描  述  : 设置链表头结点
 * 输  入  : - VOID:
 * 输  出  : 无
 * 返回值  : SAL_SOK  : 成功
 *           SAL_FAIL : 失败
 *******************************************************************************/
 void SAL_memSetListHead(List_head * pListHead);

 /*******************************************************************************
 * 函数名  : SAL_memListSortSize
 * 描  述  :对内存链表成员进行排序
 * 输  入  : 
 * 输  出  : 无
 * 返回值  : HIK_SOK  : 成功
 *             HIK_FAIL : 失败
 *******************************************************************************/
UINT32 SAL_memListSortSize (List_head* p1,List_head* p2);
 /*******************************************************************************
* 函数名    : SAL_memListSortName
* 描    述    :对内存链表name进行排序
* 输    入    : 
* 输    出    : 无
* 返回值    : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
 UINT32 SAL_memListSortName(List_head* p1,List_head* p2);
 
 /*******************************************************************************
 * 函数名  : SAL_memListCheckToFile
 * 描  述  : 遍历链表
 * 输  入  : 无
 * 输  出  : 无
 * 返回值  : HIK_SOK  : 成功
 *           HIK_FAIL : 失败
 *******************************************************************************/
 void SAL_memListCheckToFile(INT32 checkPattern);

#endif                                  /* _SAL_MEMLIST_H_*/



