/*******************************************************************************
 * sal_time.h
 *
 * HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
 *
 * Author : heshengyuan <heshengyuan@hikvision.com>
 * Version: V1.0.0  2016年10月8日 Create
 *
 * Description :
 * Modification:
 *******************************************************************************/

#ifndef _SAL_TIME_H_
#define _SAL_TIME_H_

#ifdef __cplusplus
extern "C"
{
#endif

/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */

#include "dspcommon.h"


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */

#define USED_TIME_DEFINE   struct timeval timeval; \
                           UINT32 startTime = 0; \
                           UINT32 endTime   = 0;

#define USED_TIME_START   gettimeofday(&timeval, 0); \
                          startTime = timeval.tv_sec*1000000 + timeval.tv_usec;

#define USED_TIME_END     gettimeofday(&timeval, 0); \
                          endTime = timeval.tv_sec*1000000 + timeval.tv_usec; \
                          SAL_INFO("USED Time %d us\n", endTime - startTime);



/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数定义区                                        */
/* ========================================================================== */


/*******************************************************************************
* 函数名  : SAL_getTimeOfJiffies
* 描  述  : 获取系统单调递增的时间。
* 输  入  : 无。
* 输  出  : 无。
* 返回值  : 时间值，单位是毫秒。
*******************************************************************************/
UINT64 SAL_getTimeOfJiffies(void);

/*******************************************************************************
* Function      : SAL_msleep
* Description   : 毫秒的精确延时，线程安全，不占用CPU时间
* Input         : - usecTimeOut: 超时时间，微秒值
* Output        : NONE
* Return        : HIK_SOK  : Success
*                 HIK_FAIL : Fail
*******************************************************************************/
int SAL_msleep(int msecTimeOut);

/*******************************************************************************
* 函数名  : SAL_getTimeOfDay
* 描  述  : 获取当前时间。
* 输  入  : - tv: 时间表述结构，由秒和微妙组成。
* 输  出  : 无
* 返回值  : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
INT32 SAL_getTimeOfDay(struct timeval* tv);

/*******************************************************************************
* 函数名  : SAL_mselect
* 描  述  : select 超时，精确延时，超时时使用，线程安全
* 输  入  : - fd         : 设置需要超时操作的文件句柄
*         : - msecTimeOut: 超时时间，毫秒值
* 输  出  : 无
* 返回值  : s32Ret  : select函数的返回值        
*******************************************************************************/
INT32 SAL_mselect(INT32 fd, INT32 msecTimeOut);

/*******************************************************************************
* 函数名  : SAL_getCurrentTime
* 描  述  : 获取当前时间，以年月日分秒格式输出
* 输  入  :无
* 输  出  :- current         : 设置需要超时操作的文件句柄
* 返回值  : SAL_SOK:成功
                       SAL_FAIL:失败
*           
*******************************************************************************/
INT32 SAL_getCurrentTime(INT8 *current);

/*******************************************************************************
* 函数名  : getDateTime
* 描  述  : 获取当前系统时间
* 输  入  : - pDT:
* 输  出  : 无
* 返回值  : HIK_SOK  : 成功
*           HIK_FAIL : 失败
*******************************************************************************/
void SAL_getDateTime(DATE_TIME *pDT);

/*******************************************************************************
* 函数名  : SAL_getCurrentTimeUs
* 描  述  : 获取当前时间，以 us 单位输出
* 输  入  : - pCurTime:
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
UINT64 SAL_getCurrentTimeUs(void);

/*******************************************************************************
* 函数名  : SAL_getCurrentTimeMs
* 描  述  : 获取当前时间，以 ms 单位输出
* 输  入  : - pCurTime:  以 ms 单位输出
* 输  出  : 无
* 返回值  : SAL_SOK  : 成功
*           SAL_FAIL : 失败
*******************************************************************************/
UINT64 SAL_getCurrentTimeMs(void);

#ifdef __cplusplus
}
#endif

#endif
