#ifndef _SAL_SEM_H_
#define _SAL_SEM_H_
/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */
#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <sys/sem.h>    /*包含信号量定义的头文件*/
#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/sem.h>
#include <errno.h>

/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */

int SAL_semCreate(key_t key,int nsems,int semflg);
int SAL_semSetValue(int iSemid, int iVal);
int SAL_semDel(int iSemid);
int SAL_semP(int iSemid);
int SAL_semV(int iSemid);

#endif

