/*******************************************************************************
 * sal_str.c
 *
 * HangZhou Hikvision Digital Technology Co., Ltd. All Right Reserved.
 *
 * Author : zhanglincheng <zhanglincheng@hikvision.com>
 * Version: V1.0.0  2019年7月16日 Create
 *
 * Description : 
 * Modification: 
 *******************************************************************************/

/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */
#include <sal.h>

/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数定义区                                        */
/* ========================================================================== */
/*******************************************************************************
* 函数名  : SAL_logPrint
* 描  述  : 该函数提供按指定字符分割字符串
* 输  入  : - InputStr: 输入字符串
*         : - delim: 分割符(可包含多个不同字符)
*         : -      :
* 输  出  : - OutputStr : 分割后字符数组
* 返回值  : iCmdNum  : 分割后输出字符数组元素个数
*           SAL_FAIL : 失败
*******************************************************************************/
INT32 SAL_strtok(INT8 *InputStr, const INT8 *delim, INT8 **OutputStr)
{
    char *saveptr = NULL;
    INT32 iCmdNum = 0;

    if(SAL_isNull(InputStr) || SAL_isNull(delim) || SAL_isNull(OutputStr))
    {
        SAL_ERROR("Input Null!\n");
        return SAL_FAIL;
    }

    while(NULL != (OutputStr[iCmdNum] = strtok_r(InputStr, delim, &saveptr)))
    {
        iCmdNum++;
        InputStr = NULL;
    }

    return iCmdNum;
}

